Revit 2027 API
EnergyAnalysisSurface.Tilt Property
 The tilt angle for this surface, in radians.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Tilt { get; }
Public ReadOnly Property Tilt As Double
	Get
public:
property double Tilt {
	double get ();
}
member Tilt : float with get
Property Value
Double
Remarks
 The tilt is computed as the angle of rotation between the outward normal of the surface and the Z-axis.
See Also
Reference
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace